{
  "name": "application_ruby",
  "description": "Deploys and configures Ruby-based applications",
  "long_description": "Description\n===========\n\nThis cookbook is designed to be able to describe and deploy Ruby web applications. Currently supported:\n\n* Ruby on Rails\n* Apache 2 with Passenger\n* Unicorn\n* Memcached client\n\nNote that this cookbook provides the Ruby-specific bindings for the `application` cookbook; you will find general documentation in that cookbook.\n\nOther application stacks may be supported at a later date.\n\nRequirements\n============\n\nChef 0.10.0 or higher required (for Chef environment use).\n\nThe following Opscode cookbooks are dependencies:\n\n* application\n* apache2\n* passenger_apache2\n* runit\n* unicorn\n\nResources/Providers\n==========\n\nThe LWRPs provided by this cookbook are not meant to be used by themselves; make sure you are familiar with the `application` cookbook before proceeding.\n\nrails\n------\n\nThe `rails` sub-resource LWRP deals with deploying Ruby on Rails webapps from an SCM repository. It uses the `deploy_revision` LWRP to perform the bulk of its tasks, and many concepts and parameters map directly to it. Check the documentation for `deploy_revision` for more information.\n\nFor applications that use Bundler, if a Gemfile.lock is present then gems will be installed with `bundle install --deployment`, which results in gems being installed inside the application directory.\n\nWhen running Bundler, unnecessary groups will be skipped. The list of groups to skip is determined with this algorithm:\n\n* start with this Array: `development test cucumber staging production`;\n* the group corresponding to the current environment will be removed from the Array;\n* if the `bundler_without_groups` attribute is set, those groups will be added to the Array.\n\nFor example, for a node running in the `production` Chef environment, and given:\n\n    bundler_without_groups [\"mysql\"]\n\nBundler will be run with:\n\n    bundle install --without development test cucumber staging mysql\n\n# Attribute Parameters\n\n- gems: an Array of gems to install\n- bundler: if true, `bundler` will always be used; if false it will never be. Defaults to true if `gems` includes bundler\n- bundle_command: The command to execute when calling bundler commands.  Useful for specifing alternate commands such as RVM wrappers.  Defaults to `bundle`.\n- bundler_deployment: if true, Bundler will be run with the `--deployment` options. Defaults to true if a `Gemfile.lock` is present\n- bundler\\_without\\_groups: an Array of additional Bundler groups to skip\n- database\\_master\\_role: if a role name is provided, a Chef search will be run to find a node with than role in the same environment as the current role. If a node is found, its IP address will be used when rendering the `database.yml` file, but see the \"Database block parameters\" section below\n- database\\_template: the name of the template that will be rendered to create the `database.yml` file; if specified it will be looked up in the application cookbook. Defaults to \"database.yml.erb\" from this cookbook\n- database: a block containing additional parameters for configuring the database connection\n- precompile\\_assets: if true, precompile assets for the Rails 3 asset pipeline. The default is nil, in which case we will try to autodetect whether the pipeline is in use by looking for `config/assets.yml`\n\n# Database and memcached block parameters\n\nThe database and memcached blocks can accept any method, which will result in an entry being created in the `@database` and `@memcached_envs` Hashes which are passed to the respective templates. See Usage below for more information.\n\npassenger\\_apache2\n------------------\n\nThe `passenger_apache2` sub-resource LWRP configures Apache 2 with Passenger to run the application.\n\n# Attribute Parameters\n\n- server\\_aliases: an Array of server aliases\n- webapp\\_template: the template to render to create the virtual host configuration. Defaults to \"#{application name}.conf.erb\"\n- params: an Hash of extra parameters that will be passed to the template\n\nunicorn\n-------\n\nThe `unicorn` sub-resource LWRP configures Unicorn to run the application.\n\n# Attribute Parameters\n\n- bundler: if true, Unicorn will be run with `bundle exec`; if false it will be installed and run from the default gem path. Defaults to inheriting this setting from the rails LWRP\n- preload_app: passed to the `unicorn_config` LWRP\n- worker_processes: passed to the `unicorn_config` LWRP\n- before_fork: passed to the `unicorn_config` LWRP\n- port: passed to the `unicorn_config` LWRP\n- worker_timeout: passed to the `unicorn_config` LWRP\n\nmemcached\n---------\n\nThe `memcached` sub-resource LWRP manages configuration for a Rails-compatible Memcached client.\n\n# Attribute Parameters\n\n- role: a Chef search will be run to find a node with than role in the same environment as the current node. If a node is found, its IP address will be used when rendering the `memcached.yml` file.\n- options: a block containing additional parameters for configuring the memcached client\n\nUsage\n=====\n\nA sample application that needs a database connection:\n\n    application \"redmine\" do\n      path \"/usr/local/www/redmine\"\n\n      rails do \n        database do\n          database \"redmine\"\n          username \"redmine\"\n          password \"awesome_password\"\n        end\n        database_master_role \"redmine_database_master\"\n      end\n\n      passenger_apache2 do\n      end\n    end\n\nYou can invoke any method on the database block:\n\n    application \"my-app\" do\n      path \"...\"\n      repository \"...\"\n      revision \"...\"\n\n      rails do\n        database_master_role \"my-app_database_master\"\n        database do\n          database 'name'\n          quorum 2\n          replicas %w[Huey Dewey Louie]\n        end\n      end\n    end\n\nThe corresponding entries will be passed to the context template:\n\n    <%= @database['quorum'] %>\n    <%= @database['replicas'].join(',') %>\n\nA sample application that connects to memcached:\n\n    application \"my-app\" do\n      path \"...\"\n      repository \"...\"\n      revision \"...\"\n\n      memcached do\n        role \"memcached_master\"\n        options do\n          ttl 1800\n          memory 256\n        end\n      end\n    end\n\nThis will generate a config/memcached.yml file:\n\n    production:\n      ttl: 1800\n      memory: 256\n      servers:\n        - 192.168.0.10:11211\n\nLicense and Author\n==================\n\nAuthor:: Adam Jacob (<adam@opscode.com>)\nAuthor:: Andrea Campi (<andrea.campi@zephirworks.com.com>)\nAuthor:: Joshua Timberman (<joshua@opscode.com>)\nAuthor:: Seth Chisamore (<schisamo@opscode.com>)\n\nCopyright 2009-2012, Opscode, Inc.\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n",
  "maintainer": "Opscode, Inc.",
  "maintainer_email": "cookbooks@opscode.com",
  "license": "Apache 2.0",
  "platforms": {
  },
  "dependencies": {
    "application": ">= 0.0.0",
    "unicorn": ">= 0.0.0",
    "apache2": ">= 0.0.0",
    "passenger_apache2": ">= 0.0.0",
    "runit": "~> 1.0"
  },
  "recommendations": {
  },
  "suggestions": {
  },
  "conflicting": {
  },
  "providing": {
  },
  "replacing": {
  },
  "attributes": {
  },
  "groupings": {
  },
  "recipes": {
  },
  "version": "1.1.0"
}